{"pageProps":{"projectPageData":{"projectName":"academic-tracker","singleProjectData":{"pathName":"academic-tracker","name":"Academic Tracker","picPath":"/images/academicTracker.png","projectLink":"https://awesome-gates-3270af.netlify.app","githubLink":"https://github.com/srivera12/projects/tree/master/academic-tracker","blurb":"I made this for my little sister, who is in high school. She needed to keep track of completed assignments for each class as simply as possible, but also wanted some fun features.","approach":"This was the first project that was completely my own from start to finish, so I chose to use what I had been working with most frequently - Create React App and Material UI. I also talked with my sister at length about what she needed from this app so that it would actually be useful for her.","challenges":["My sister wanted things as simple as possible. She didn't want to have to enter in any information about the assignments, just the class and the number of assignments. She also wanted it to track week to week rather than daily or for the semester.","My sister is a teenager, and she wanted the app to be fun and encouraging. So I needed to find tools that would allow for fun celebratory effects when she finished all the assignments for a class, or all her assignments for the week.","Once I completed the app, my sister requested the ability to customize the background with colors or images. This required using some tools I haven't used before, finding a way to dynamically render a background image, figuring out how to allow the user to switch between having a customized background image or background color, as well as how to save their customizations to local storage."],"reflections":"This is my most recent project, so I don't have the same level of hindsight about it that I do for my other projects. However, I am very happy with how this turned out. It has all the features and functionality my sister requested, and she has been finding it useful to help keep track of her academic work."}}},"__N_SSG":true}